<!DOCTYPE html>

<html lang="es">
    <head>
        <meta charset="UTF-8">
        <meta name="viewport" content="width=device-width, initial-scale=1.0">
        <meta name="descripcion" content="
        Historia de las aplicaciones web, sus origenes, evoluci&oacute;n y el impacto actual.
        ">
        <meta name="keywords" content="Historia, Web, Aplicaciones, Evoluci&oacute;n">
        <style>
            body{
                font-family: Arial, sans-serif;
                margin: 20px;
                nav a {
                    margin-right: 15px;
                    text-decoration: none;
                    color: #2980B9;
                }

                nav a:hover{
                    color: black;
                    font-size: 20px;
                }

                a{
                    margin-right: 15px;
                    text-decoration: none;
                    color: #2980B9;   
                }
            }
        </style>
    </head>
    <body>
        <nav>
            <a href="indice.html">Inicio</a>
            <a href="historia.html">Historia Web</a>
            <a href="cv.html">CV</a>
        </nav>
        <header>
            <h1>Historia de Aplicaciones Web</h1>
            <p>Explora los hitos hist&oacute;ricos de la web.</p>
        </header>
        <section>
            <p><a href="historia.html#origenes">-> Or&iacute;genes</a></p>
            <p><a href="historia.html#evolucion">-> Evoluci&oacute;n</a></p>
            <p><a href="historia.html#impacto">-> Impacto</a></p>
        </section>

        <section id="origenes">
            <h2>Or&iacute;genes</h2>
            <h3>ERA MILITAR DE LA INFORM&Aacute;TICA (1945-1970)</h3>
            <p>
            Descripción: En esta etapa, la computaci&oacute;n surge con un enfoque militar. Durante la Segunda Guerra Mundial, Alan Turing desarroll&oacute; conceptos fundamentales para la inform&aacute;tica y la criptograf&iacute;a.
            <br>Tecnolog&iacute;as Clave: ENIAC, ARPANET, computadoras de gran tama&ntilde;o y c&aacute;lculo matem&aacute;tico automatizado.
            </p>

            <h4>Nacimiento del ENIAC</h4>
            <p>
                Se construy&oacute; el primer ordenador de propósito general, el ENIAC (Electronic Numerical Integrator and Computer), en la Universidad de Pensilvania, utilizado principalmente para calcular tablas de artiller&iacute;a.
            <br>
            <h4>Creaci&oacute;n de ARPANET</h4>
            <p>En 1969, se desarroll&oacute; ARPANET, considerada la precursora de Internet, financiada por la Agencia de Proyectos de Investigaci&oacute;n Avanzada de EE.UU. (ARPA). Su diseño altamente distribuido permit&iacute;a la comunicación incluso en caso de ataques nucleares, una caracter&iacute;stica clave que se mantuvo en el desarrollo de Internet.</p>
            <h4> ERA Inform&aacute;tica Empresarial (1970 - 1980)</h4>
            <p>Descripci&oacute;n: Las computadoras comenzaron a utilizarse en los negocios para la gesti&oacute;n de n&oacute;minas, inventarios y automatizaci&oacute;n de procesos administrativos. Debido a su alto costo, solo grandes empresas podían permitirse su adquisici&oacute;n.
                Tecnolog&iacute;as Clave: Ma&iacute;nframes, bases de datos primitivas, lenguajes de programaci&oacute;n como COBOL y Fortran.
                Impacto Social: La automatizaci&oacute;n de procesos empresariales mejor&oacute; la eficiencia y redujo la dependencia del trabajo manual, aunque el acceso a la tecnolog&iacute;a estaba restringido a grandes corporaciones.
                </p>
        </section>
        <section id="evolucion">
            <h2>Evoluci&oacute;n</h2>
            <p>
                Era de la Computadora Personal (1980 - 1990)
                La computaci&oacute;n se hizo accesible al consumidor promedio con la introducc&oacute;n de las computadoras personales (PC). Estas se usaban principalmente para hojas de c&aacute;lculo y procesamiento de texto. Con el tiempo, tambi&eacute;n se incorporaron en el entorno empresarial.
                Tecnolog&iacute;as Clave: Computadoras personales (PC), sistemas operativos como MS-DOS y Macintosh, redes TCP/IP, desarrollo de la WWW. Evolucionando en un desarrollo continuo para que la web sufriera cambios durante a&ntilde;os, teniendo 4 etapas: <a href="historia.html#web1">Web 1.0</a>, <a href="historia.html#web2">Web 2.0</a>, <a href="historia.html#web3">Web 3.0</a> y
                <a href="historia.html#web4">Web 4.0</a>, a continuaci&oacute;n se detallaran cada una de estas fases o etapas
                que evolucionaron a la web que conocemos hoy en d&iacute;a. 
            </p>
            <br>
            <h4 id="web1">WEB 1.0 (1990-2000)</h4>
            <p>
                La Word Wide Web fue creada por TimBernes Lee en 1990, el cual fue un sistema basado en hipertexto, que permite clasificar informaci&oacute;n de diversos tipos conocidos como la gran telaraña mundial. Dio acceso global a la información desde los hogares, teniendo un avance en la educaci&oacute;n, comunicaci&oacute;n y comercio.
                <br> Tecnolog&iacute;as que surgieron: <br>
                MOSAIC, NETSCAPE, AMAZON, INTERNET EXPLORER
            </p>
            <br>
            <h4 id="web2">WEB 2.0 (2000-2010)</h4>
            <p>
                El usuario es el centro, es decir es protagonico y puede crear y compartir.
                Lo social cobra fuerte protagonismo
                .Se evoluciono hacia una mejor interactividad , participaci&oacute;n del usuario y generacion de contenido dinamico.
                <br>Tecnolog&iacute;as que surgieron: <br>
                Wikipedia, RSS, Facebook, Gmail, Youtube, Twitter,
                Amazon EC2
            </p>
            <br>
            <h4 id="web3">Web 3.0 (2005-2020)</h4>
            <p>
                Este per&iacute;odo abarco de 2010 a 2015 se enmarca dentro de la era de la Web 3.0, caracterizada por un enfoque en la Web Sem&aacute;ntica, donde la búsqueda de informaci&oacute;n se orienta hacia las necesidades del usuario utilizando un lenguaje similar al cotidiano.
                <br>Tecnolog&iacute;as que surgieron: <br>
                PHP 7.0
                <br>Impacto:<br>
                Auge del comercio electr&oacute;nico, dominio de los dispositivos m&oacute;viles, dise&ntilde;o responsivo en auge.
            </p>
            <br>

            <h4 id="web4">WEB 4.0 (2015-2030)</h4>
            <p>
                Se comienza a conceptualizar una web m&aacute;s inteligente e interactiva, con capacidades predictivas y personalizadas.
                <br>Tecnolog&iacute;as que surgieron: <br>
                Face++, Siri, Cortana, Face ID, ChatGPT.
            </p>
            <br>

        </section>
        <section id="impacto">
            <h2>Impacto actual</h2>
            <p>
                Desde que se crea el ARPANET hasta la Web 4.0, la evoluci&oacute;n de la web ha transformado
                significativamente a la sociedad, en diversos sectores. Esto en favor de la innovaci&oacute;n, para facilitrar
                la vida cotidiana a nivel mundial.
            </p>
            <h4>Sector Educativo</h4>
            <p>
                Creaci&oacute;n de plataformas interacticas, videoconferencias y asistentes virtuales (IA).
            </p>
            <h4>Sector Financiero</h4>
            <p>
                Las compras fueron punto clave en la web, ya que el auge del comercio electrónico y el desarrollo de
                pagos digitales aumentaron el consumo de sitios que ofrecieran dichos servicios.
            </p>
            <h4>Sector Tecnol&oacute;gico</h4>
            <p>Automatizaci&oacute;n de tareas y la asistencia personalizada.</p>
        </section>
    </body>
    </html>